package com.pw.basic.queue;

import java.util.ArrayList;
import java.util.Date;
import java.util.List;
import java.util.Random;
import java.util.concurrent.ArrayBlockingQueue;

/**
 * 1.改造计划： 多读线程，相对稳定 多写线程，时间跨度大<br/>
 * 2.存在先打印--- 4，再打印+++ 4的情况。如何保证System.out.println方法同步？<br/>
 * 3.引出问题：如何保证一段代码的原子性，中间不背其他线程打扰？
 * 4.原子性与可见性，相随。
 * 
 * @author Administrator
 *
 */
public class ArrayBlockingQueueTest2 {
	private static ArrayBlockingQueue<Integer> queue = new ArrayBlockingQueue<>(100);
	private static int atom = 0;

	/**
	 * 生成[min,max]随机数，包含两端
	 * 
	 * @param min
	 * @param max
	 * @return
	 */
	public static int range(int min, int max) {
		Random random = new Random();
		return random.nextInt(max) % (max - min + 1) + min;
	}
	
	public static void println(String s){
		synchronized(String.class) {
			System.out.println(s);
		}
	}

	public static void main(String[] args) {
		int readThread = 30, writeThread = 40;
		// 启动读线程
		for (int i = 0; i < readThread; i++) {
			new Thread(new ReadThread()).start();
		}
		// 启动线程，每秒打印队列内容
		new Thread(new Runnable() {
			@Override
			public void run() {
				// TODO Auto-generated method stub
				while (true) {
					try {
						Thread.sleep(1000);
					} catch (InterruptedException e) {
						// TODO Auto-generated catch block
						e.printStackTrace();
					}
					println("队列内容：" + queue);
				}
			}
		}).start();

		for (int i = 0; i < writeThread; i++) {
			new WriteThread().start();
		}
	}

	// 耗时线程，消费者
	static class ReadThread extends Thread {
		public void run() {
			try {
				while (true) {
					Thread.sleep(range(1000, 2000));
					Date date = new Date();
//					println("reading");
					// 可能阻塞
					int x = queue.take();
					Date now = new Date();
					println("--- " + x + " \t耗时：" + (now.getTime() - date.getTime()) + "ms"
							+ (now.compareTo(date) > 0 ? " 发生了-------阻塞" : ""));
				}
			} catch (InterruptedException e) {
				e.printStackTrace();
			}
		}
	}

	// 耗时线程 生产者
	static class WriteThread extends Thread {
		public void run() {
			try {
				while (true) {
					Thread.sleep(range(1000, 3000));
					Date date = new Date();
//					println("writing");
					// 可能阻塞
					queue.put(++atom);
					Date now = new Date();
					println("+++ " + atom + " \t耗时：" + (now.getTime() - date.getTime()) + "ms"
							+ (now.compareTo(date) > 0 ? " 发生了++++++++阻塞" : ""));
				}
			} catch (InterruptedException e) {
				e.printStackTrace();
			}
		}
	}

	private static List<String> init() {
		List<String> list = new ArrayList<>();
		for (int i = 0; i < 10; i++) {
			list.add("atom" + i);
		}
		return list;
	}
}
/*
附录1.



队列内容：[]
+++ 1 	耗时：0ms
--- 1 	耗时：29ms 发生了-------阻塞
+++ 2 	耗时：0ms
--- 2 	耗时：56ms 发生了-------阻塞
+++ 3 	耗时：0ms
--- 3 	耗时：61ms 发生了-------阻塞
--- 4 	耗时：28ms 发生了-------阻塞
+++ 4 	耗时：0ms
+++ 5 	耗时：0ms
+++ 6 	耗时：0ms
--- 5 	耗时：0ms
+++ 7 	耗时：0ms
--- 6 	耗时：0ms
--- 7 	耗时：0ms
--- 8 	耗时：24ms 发生了-------阻塞
+++ 8 	耗时：0ms
--- 9 	耗时：5ms 发生了-------阻塞
+++ 9 	耗时：0ms
+++ 10 	耗时：0ms
--- 10 	耗时：91ms 发生了-------阻塞
+++ 11 	耗时：0ms
--- 11 	耗时：224ms 发生了-------阻塞
+++ 12 	耗时：0ms
--- 12 	耗时：202ms 发生了-------阻塞
+++ 13 	耗时：0ms
--- 13 	耗时：179ms 发生了-------阻塞
+++ 14 	耗时：0ms
--- 14 	耗时：153ms 发生了-------阻塞
+++ 15 	耗时：0ms
--- 15 	耗时：127ms 发生了-------阻塞
--- 16 	耗时：157ms 发生了-------阻塞
+++ 16 	耗时：0ms
+++ 17 	耗时：0ms
--- 17 	耗时：138ms 发生了-------阻塞
+++ 18 	耗时：0ms
--- 18 	耗时：149ms 发生了-------阻塞
+++ 19 	耗时：0ms
--- 19 	耗时：237ms 发生了-------阻塞
+++ 20 	耗时：0ms
--- 20 	耗时：237ms 发生了-------阻塞
+++ 21 	耗时：0ms
--- 21 	耗时：293ms 发生了-------阻塞
+++ 22 	耗时：0ms
--- 22 	耗时：251ms 发生了-------阻塞
+++ 23 	耗时：0ms
--- 23 	耗时：256ms 发生了-------阻塞
队列内容：[]
+++ 24 	耗时：0ms
--- 24 	耗时：303ms 发生了-------阻塞
+++ 25 	耗时：0ms
--- 25 	耗时：264ms 发生了-------阻塞
+++ 26 	耗时：0ms
--- 26 	耗时：324ms 发生了-------阻塞
+++ 27 	耗时：0ms
--- 27 	耗时：279ms 发生了-------阻塞
+++ 28 	耗时：0ms
--- 28 	耗时：323ms 发生了-------阻塞
+++ 29 	耗时：0ms
--- 29 	耗时：281ms 发生了-------阻塞
+++ 30 	耗时：0ms
--- 30 	耗时：293ms 发生了-------阻塞
+++ 31 	耗时：0ms
--- 31 	耗时：106ms 发生了-------阻塞
+++ 32 	耗时：0ms
--- 32 	耗时：148ms 发生了-------阻塞
+++ 33 	耗时：0ms
--- 33 	耗时：144ms 发生了-------阻塞
+++ 34 	耗时：0ms
--- 34 	耗时：26ms 发生了-------阻塞
+++ 35 	耗时：0ms
--- 35 	耗时：132ms 发生了-------阻塞
+++ 36 	耗时：0ms
--- 36 	耗时：56ms 发生了-------阻塞
+++ 37 	耗时：0ms
+++ 38 	耗时：0ms
+++ 39 	耗时：0ms
+++ 40 	耗时：0ms
+++ 41 	耗时：0ms
+++ 42 	耗时：0ms
+++ 43 	耗时：0ms
--- 37 	耗时：0ms
--- 38 	耗时：0ms
--- 39 	耗时：0ms
--- 40 	耗时：0ms
+++ 44 	耗时：0ms
+++ 45 	耗时：0ms
+++ 46 	耗时：0ms
+++ 47 	耗时：0ms
--- 41 	耗时：0ms
--- 42 	耗时：0ms
--- 43 	耗时：0ms
--- 44 	耗时：0ms
+++ 48 	耗时：0ms
+++ 49 	耗时：0ms
+++ 50 	耗时：0ms
队列内容：[45, 46, 47, 48, 49, 50]
--- 45 	耗时：0ms
+++ 51 	耗时：0ms
+++ 52 	耗时：0ms
+++ 53 	耗时：0ms
+++ 54 	耗时：0ms
+++ 55 	耗时：0ms
--- 46 	耗时：0ms
+++ 56 	耗时：0ms
+++ 57 	耗时：0ms
--- 47 	耗时：0ms
+++ 58 	耗时：0ms
--- 48 	耗时：0ms
+++ 59 	耗时：0ms
--- 49 	耗时：0ms
--- 50 	耗时：0ms
--- 51 	耗时：0ms
+++ 60 	耗时：0ms
--- 52 	耗时：0ms
+++ 61 	耗时：0ms
--- 53 	耗时：0ms
+++ 62 	耗时：0ms
--- 54 	耗时：0ms
--- 55 	耗时：0ms
+++ 63 	耗时：0ms
+++ 64 	耗时：0ms
--- 56 	耗时：0ms
--- 57 	耗时：0ms
--- 58 	耗时：0ms
+++ 65 	耗时：0ms
--- 59 	耗时：0ms
+++ 66 	耗时：0ms
--- 60 	耗时：0ms
+++ 67 	耗时：0ms
--- 61 	耗时：0ms
+++ 68 	耗时：0ms
+++ 69 	耗时：0ms
--- 62 	耗时：0ms
+++ 70 	耗时：0ms
+++ 71 	耗时：0ms
+++ 72 	耗时：0ms
+++ 73 	耗时：1ms 发生了++++++++阻塞
--- 63 	耗时：0ms
队列内容：[64, 65, 66, 67, 68, 69, 70, 71, 72, 73]
--- 64 	耗时：0ms
+++ 74 	耗时：0ms
--- 65 	耗时：0ms
+++ 75 	耗时：0ms
--- 66 	耗时：0ms
--- 67 	耗时：0ms
+++ 76 	耗时：0ms
+++ 77 	耗时：0ms
+++ 78 	耗时：0ms
--- 68 	耗时：0ms
--- 69 	耗时：0ms
--- 70 	耗时：0ms
+++ 79 	耗时：0ms
+++ 80 	耗时：0ms
--- 71 	耗时：0ms
--- 72 	耗时：0ms
+++ 81 	耗时：0ms
+++ 82 	耗时：0ms
+++ 83 	耗时：0ms
+++ 84 	耗时：0ms
--- 73 	耗时：0ms
+++ 85 	耗时：0ms
+++ 86 	耗时：0ms
--- 74 	耗时：0ms
+++ 87 	耗时：0ms
+++ 88 	耗时：0ms
+++ 89 	耗时：0ms
--- 75 	耗时：0ms
--- 76 	耗时：0ms
--- 77 	耗时：0ms
+++ 90 	耗时：0ms
--- 78 	耗时：0ms
--- 79 	耗时：0ms
+++ 91 	耗时：0ms
+++ 92 	耗时：0ms
--- 80 	耗时：0ms
--- 81 	耗时：0ms
+++ 93 	耗时：0ms
--- 82 	耗时：0ms
+++ 94 	耗时：0ms
--- 83 	耗时：0ms
--- 84 	耗时：0ms
队列内容：[85, 86, 87, 88, 89, 90, 91, 92, 93, 94]
--- 85 	耗时：0ms
+++ 95 	耗时：0ms
+++ 96 	耗时：0ms
+++ 97 	耗时：0ms
--- 86 	耗时：0ms
--- 87 	耗时：0ms
--- 88 	耗时：0ms
+++ 98 	耗时：0ms
--- 89 	耗时：0ms
--- 90 	耗时：0ms
+++ 99 	耗时：0ms
+++ 100 	耗时：0ms
--- 91 	耗时：0ms
+++ 101 	耗时：0ms
--- 92 	耗时：0ms
+++ 102 	耗时：0ms
--- 93 	耗时：0ms
+++ 103 	耗时：0ms
+++ 104 	耗时：0ms
--- 94 	耗时：0ms
+++ 105 	耗时：0ms
--- 95 	耗时：0ms
--- 96 	耗时：0ms
+++ 106 	耗时：0ms
+++ 107 	耗时：0ms
+++ 108 	耗时：0ms
--- 97 	耗时：0ms
--- 98 	耗时：0ms
+++ 109 	耗时：0ms
+++ 110 	耗时：0ms
+++ 111 	耗时：0ms
+++ 112 	耗时：0ms
--- 99 	耗时：0ms
--- 100 	耗时：0ms
--- 101 	耗时：0ms
+++ 113 	耗时：0ms
--- 102 	耗时：0ms
+++ 114 	耗时：0ms
+++ 115 	耗时：0ms
--- 103 	耗时：0ms
--- 104 	耗时：0ms
队列内容：[105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115]
--- 105 	耗时：0ms
+++ 116 	耗时：0ms
--- 106 	耗时：0ms
+++ 117 	耗时：0ms
--- 107 	耗时：0ms
--- 108 	耗时：0ms
+++ 118 	耗时：0ms
--- 109 	耗时：0ms
--- 110 	耗时：0ms
--- 111 	耗时：0ms
+++ 119 	耗时：0ms
+++ 120 	耗时：0ms
+++ 121 	耗时：0ms
+++ 122 	耗时：0ms
--- 112 	耗时：0ms
+++ 123 	耗时：0ms
+++ 124 	耗时：0ms
--- 113 	耗时：0ms
--- 114 	耗时：0ms
+++ 125 	耗时：0ms
--- 115 	耗时：0ms
+++ 126 	耗时：0ms
+++ 127 	耗时：0ms
--- 116 	耗时：0ms
+++ 128 	耗时：0ms
+++ 129 	耗时：0ms
+++ 130 	耗时：0ms
+++ 131 	耗时：0ms
+++ 132 	耗时：0ms
--- 117 	耗时：0ms
+++ 133 	耗时：0ms
--- 118 	耗时：0ms
--- 119 	耗时：0ms
+++ 134 	耗时：0ms
+++ 135 	耗时：0ms
--- 120 	耗时：0ms
队列内容：[121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135]
--- 121 	耗时：0ms
+++ 136 	耗时：0ms
+++ 137 	耗时：0ms
--- 122 	耗时：0ms
--- 123 	耗时：0ms
+++ 138 	耗时：0ms
+++ 139 	耗时：0ms
--- 124 	耗时：0ms
+++ 140 	耗时：0ms
--- 125 	耗时：0ms
+++ 141 	耗时：0ms
+++ 142 	耗时：0ms
+++ 143 	耗时：0ms
--- 126 	耗时：0ms
--- 127 	耗时：0ms
+++ 144 	耗时：0ms
+++ 145 	耗时：0ms
--- 128 	耗时：0ms
+++ 146 	耗时：0ms
+++ 147 	耗时：0ms
--- 129 	耗时：0ms
--- 130 	耗时：0ms
--- 131 	耗时：0ms
+++ 148 	耗时：0ms
+++ 149 	耗时：0ms
--- 132 	耗时：0ms
+++ 150 	耗时：0ms
--- 133 	耗时：0ms
+++ 151 	耗时：0ms
--- 134 	耗时：0ms
--- 135 	耗时：0ms
+++ 152 	耗时：0ms
--- 136 	耗时：0ms
+++ 153 	耗时：0ms
--- 137 	耗时：0ms
--- 138 	耗时：0ms
--- 139 	耗时：0ms
+++ 154 	耗时：0ms
+++ 155 	耗时：0ms
+++ 156 	耗时：0ms
+++ 157 	耗时：0ms
--- 140 	耗时：0ms
--- 141 	耗时：0ms
--- 142 	耗时：0ms
--- 143 	耗时：0ms
--- 144 	耗时：0ms
+++ 158 	耗时：0ms
--- 145 	耗时：0ms
--- 146 	耗时：0ms
队列内容：[147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158]
+++ 159 	耗时：0ms
--- 147 	耗时：0ms
+++ 160 	耗时：0ms
+++ 161 	耗时：0ms
+++ 162 	耗时：0ms
--- 148 	耗时：0ms
--- 149 	耗时：0ms
--- 150 	耗时：0ms
--- 151 	耗时：0ms
+++ 163 	耗时：0ms
+++ 164 	耗时：0ms
+++ 165 	耗时：0ms
+++ 166 	耗时：0ms
--- 152 	耗时：0ms
+++ 167 	耗时：0ms
+++ 168 	耗时：0ms
--- 153 	耗时：0ms
--- 154 	耗时：0ms
+++ 169 	耗时：0ms
+++ 170 	耗时：0ms
--- 155 	耗时：0ms
--- 156 	耗时：0ms
+++ 171 	耗时：0ms
+++ 172 	耗时：0ms
+++ 173 	耗时：0ms
--- 157 	耗时：0ms
--- 158 	耗时：0ms
--- 159 	耗时：0ms
--- 160 	耗时：0ms
--- 161 	耗时：0ms
--- 162 	耗时：0ms
--- 163 	耗时：0ms
--- 164 	耗时：0ms
+++ 174 	耗时：0ms
--- 165 	耗时：0ms
队列内容：[166, 167, 168, 169, 170, 171, 172, 173, 174]
+++ 175 	耗时：0ms
+++ 176 	耗时：0ms
+++ 177 	耗时：0ms
+++ 178 	耗时：0ms
--- 166 	耗时：0ms
+++ 179 	耗时：0ms
+++ 180 	耗时：0ms
--- 167 	耗时：0ms
+++ 181 	耗时：0ms
--- 168 	耗时：0ms
--- 169 	耗时：0ms
+++ 182 	耗时：0ms
+++ 183 	耗时：0ms
+++ 184 	耗时：0ms
+++ 185 	耗时：0ms
--- 170 	耗时：0ms
+++ 186 	耗时：0ms
+++ 187 	耗时：0ms
+++ 188 	耗时：0ms
+++ 189 	耗时：0ms
--- 171 	耗时：0ms
--- 172 	耗时：0ms
+++ 190 	耗时：0ms
+++ 191 	耗时：0ms
--- 173 	耗时：0ms
--- 174 	耗时：0ms
--- 175 	耗时：0ms
--- 176 	耗时：0ms
+++ 192 	耗时：0ms
+++ 193 	耗时：0ms
--- 177 	耗时：0ms
+++ 194 	耗时：0ms
--- 178 	耗时：0ms
--- 179 	耗时：0ms
--- 180 	耗时：0ms
+++ 195 	耗时：0ms
--- 181 	耗时：0ms
--- 182 	耗时：0ms
+++ 196 	耗时：0ms
+++ 197 	耗时：0ms
--- 183 	耗时：0ms
+++ 198 	耗时：0ms
队列内容：[184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198]
--- 184 	耗时：0ms
--- 185 	耗时：0ms
+++ 199 	耗时：0ms
+++ 200 	耗时：0ms
--- 186 	耗时：0ms
+++ 201 	耗时：0ms
--- 187 	耗时：0ms
--- 188 	耗时：0ms
--- 189 	耗时：0ms
+++ 202 	耗时：0ms
+++ 203 	耗时：0ms
+++ 204 	耗时：0ms
--- 190 	耗时：0ms
--- 191 	耗时：0ms
+++ 205 	耗时：0ms
--- 192 	耗时：0ms
+++ 206 	耗时：0ms
--- 193 	耗时：0ms
--- 194 	耗时：0ms
+++ 207 	耗时：0ms
+++ 208 	耗时：0ms
+++ 209 	耗时：0ms
--- 195 	耗时：0ms
--- 196 	耗时：0ms
+++ 210 	耗时：0ms
+++ 211 	耗时：0ms
+++ 212 	耗时：0ms
+++ 213 	耗时：0ms
+++ 214 	耗时：0ms
--- 197 	耗时：0ms
--- 198 	耗时：0ms
+++ 215 	耗时：0ms
--- 199 	耗时：0ms
+++ 216 	耗时：0ms
+++ 217 	耗时：0ms
--- 200 	耗时：0ms
*/
